"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Packa upp till aktuell mapp";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Packa upp till skrivbordet";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Packa upp till...";
